ambraglow/pcb-design/cube/cube.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_19
ADC1.CommonPathInternal=null|null|null|null
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master,CommonPathInternal
ADC1.NbrOfConversionFlag=1
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC1.Rank-0\#ChannelRegularConversion=1
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ADC1.master=1
BootLoader.IPs=DDR,RCC,TAMP,UART4,I2C4,USB_OTG_HS,SDMMC3,IWDG2,SDMMC1
BootROM.IPs=RCC,TAMP,UART4,USB_OTG_HS,SDMMC1
CAD.formats=
CAD.pinconfig=
CAD.provider=
CortexA7NS.IPs=IWDG2,BSEC,DDR,ETZPC,HSEM,IPCC,PWR,RCC,RTC,TAMP,GPIO,DMA,GIC,DEBUG,UART4,I2C4,USB_OTG_HS,I2S2,SPI2,SDMMC3,UART8,I2S3,SPI3,ETH1,SPI5,I2C6,FDCAN2,USBH_HS1,DSIHOST,SDMMC1,LTDC,USART6,UART7,I2C1,ADC1,ADC2,TIM16
CortexA7S.IPs=IWDG2,BSEC,DDR,ETZPC,HSEM,PWR,RCC,RNG1,RTC,TAMP,GIC\:I,I2C4
CortexM4.IPs=IPCC,ETZPC,FREERTOS,HSEM,PWR,RCC,SYS\:I,GPIO,DMA,NVIC\:I
DDR.ADDRMAP1=0x00070707
DDR.ADDRMAP3=0x1F000000
DDR.ADDRMAP5=0x06060606
DDR.ADDRMAP6=0x0F060606
DDR.CL=6
DDR.CWL=5
DDR.DDR_Frequency=400.0
DDR.DRAMTMG0=0x0F141B0F
DDR.DRAMTMG1=0x000A0415
DDR.DRAMTMG2=0x0506080E
DDR.DRAMTMG4=0x06040406
DDR.DRAMTMG5=0x05050403
DDR.DTPR0=0x2A8F66D0
DDR.DTPR1=0x096800A0
DDR.DTPR2=0x10022A00
DDR.IPParameters=DDR_Frequency,CL,RL,CWL,WL,addrmap_col_b9,addrmap_col_b10,addrmap_col_b11,addrmap_bank_b0,addrmap_bank_b1,addrmap_bank_b2,addrmap_row_b0,addrmap_row_b1,addrmap_row_b2_10,addrmap_row_b11,addrmap_row_b12,addrmap_row_b13,addrmap_row_b14,addrmap_row_b15,MSTR,RFSHTMG,DRAMTMG0,DRAMTMG1,DRAMTMG2,DRAMTMG4,DRAMTMG5,SCHED,ADDRMAP1,ADDRMAP3,ADDRMAP5,ADDRMAP6,PTR0,PTR1,PTR2,DTPR0,DTPR1,DTPR2,MR0,MR2
DDR.MR0=0x00000420
DDR.MR2=0x00000200
DDR.MSTR=0x00041401
DDR.PTR0=0x00220014
DDR.PTR1=0x03630D40
DDR.PTR2=0x042D3880
DDR.RFSHTMG=0x00610068
DDR.RL=6
DDR.SCHED=0x00000C01
DDR.WL=5
DDR.addrmap_bank_b0=7
DDR.addrmap_bank_b1=7
DDR.addrmap_bank_b2=7
DDR.addrmap_col_b10=31
DDR.addrmap_col_b11=31
DDR.addrmap_col_b9=31
DDR.addrmap_row_b0=6
DDR.addrmap_row_b1=6
DDR.addrmap_row_b11=6
DDR.addrmap_row_b12=6
DDR.addrmap_row_b13=6
DDR.addrmap_row_b14=6
DDR.addrmap_row_b15=15
DDR.addrmap_row_b2_10=6
DDR_A0.GPIOParameters=PinAttribute
DDR_A0.Mode=DDR3
DDR_A0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A0.Signal=DDR_A0
DDR_A1.GPIOParameters=PinAttribute
DDR_A1.Mode=DDR3
DDR_A1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A1.Signal=DDR_A1
DDR_A10.GPIOParameters=PinAttribute
DDR_A10.Mode=DDR3
DDR_A10.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A10.Signal=DDR_A10
DDR_A11.GPIOParameters=PinAttribute
DDR_A11.Mode=DDR3
DDR_A11.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A11.Signal=DDR_A11
DDR_A12.GPIOParameters=PinAttribute
DDR_A12.Mode=4Gb_16bits
DDR_A12.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A12.Signal=DDR_A12
DDR_A13.GPIOParameters=PinAttribute
DDR_A13.Mode=4Gb_16bits
DDR_A13.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A13.Signal=DDR_A13
DDR_A14.GPIOParameters=PinAttribute
DDR_A14.Mode=4Gb_16bits
DDR_A14.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A14.Signal=DDR_A14
DDR_A2.GPIOParameters=PinAttribute
DDR_A2.Mode=DDR3
DDR_A2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A2.Signal=DDR_A2
DDR_A3.GPIOParameters=PinAttribute
DDR_A3.Mode=DDR3
DDR_A3.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A3.Signal=DDR_A3
DDR_A4.GPIOParameters=PinAttribute
DDR_A4.Mode=DDR3
DDR_A4.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A4.Signal=DDR_A4
DDR_A5.GPIOParameters=PinAttribute
DDR_A5.Mode=DDR3
DDR_A5.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A5.Signal=DDR_A5
DDR_A6.GPIOParameters=PinAttribute
DDR_A6.Mode=DDR3
DDR_A6.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A6.Signal=DDR_A6
DDR_A7.GPIOParameters=PinAttribute
DDR_A7.Mode=DDR3
DDR_A7.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A7.Signal=DDR_A7
DDR_A8.GPIOParameters=PinAttribute
DDR_A8.Mode=DDR3
DDR_A8.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A8.Signal=DDR_A8
DDR_A9.GPIOParameters=PinAttribute
DDR_A9.Mode=DDR3
DDR_A9.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A9.Signal=DDR_A9
DDR_ATO.GPIOParameters=PinAttribute
DDR_ATO.Mode=DDR3
DDR_ATO.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_ATO.Signal=DDR_ATO
DDR_BA0.GPIOParameters=PinAttribute
DDR_BA0.Mode=DDR3
DDR_BA0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_BA0.Signal=DDR_BA0
DDR_BA1.GPIOParameters=PinAttribute
DDR_BA1.Mode=DDR3
DDR_BA1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_BA1.Signal=DDR_BA1
DDR_BA2.GPIOParameters=PinAttribute
DDR_BA2.Mode=DDR3
DDR_BA2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_BA2.Signal=DDR_BA2
DDR_CASN.GPIOParameters=PinAttribute
DDR_CASN.Mode=DDR3
DDR_CASN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CASN.Signal=DDR_CASN
DDR_CKE.GPIOParameters=PinAttribute
DDR_CKE.Mode=DDR3
DDR_CKE.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CKE.Signal=DDR_CKE
DDR_CLKN.GPIOParameters=PinAttribute
DDR_CLKN.Mode=DDR3
DDR_CLKN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CLKN.Signal=DDR_CLKN
DDR_CLKP.GPIOParameters=PinAttribute
DDR_CLKP.Mode=DDR3
DDR_CLKP.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CLKP.Signal=DDR_CLKP
DDR_CSN.GPIOParameters=PinAttribute
DDR_CSN.Mode=DDR3
DDR_CSN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CSN.Signal=DDR_CSN
DDR_DQ0.GPIOParameters=PinAttribute
DDR_DQ0.Mode=DDR3
DDR_DQ0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ0.Signal=DDR_DQ0
DDR_DQ1.GPIOParameters=PinAttribute
DDR_DQ1.Mode=DDR3
DDR_DQ1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ1.Signal=DDR_DQ1
DDR_DQ10.GPIOParameters=PinAttribute
DDR_DQ10.Mode=DDR3
DDR_DQ10.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ10.Signal=DDR_DQ10
DDR_DQ11.GPIOParameters=PinAttribute
DDR_DQ11.Mode=DDR3
DDR_DQ11.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ11.Signal=DDR_DQ11
DDR_DQ12.GPIOParameters=PinAttribute
DDR_DQ12.Mode=DDR3
DDR_DQ12.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ12.Signal=DDR_DQ12
DDR_DQ13.GPIOParameters=PinAttribute
DDR_DQ13.Mode=DDR3
DDR_DQ13.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ13.Signal=DDR_DQ13
DDR_DQ14.GPIOParameters=PinAttribute
DDR_DQ14.Mode=DDR3
DDR_DQ14.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ14.Signal=DDR_DQ14
DDR_DQ15.GPIOParameters=PinAttribute
DDR_DQ15.Mode=DDR3
DDR_DQ15.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ15.Signal=DDR_DQ15
DDR_DQ2.GPIOParameters=PinAttribute
DDR_DQ2.Mode=DDR3
DDR_DQ2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ2.Signal=DDR_DQ2
DDR_DQ3.GPIOParameters=PinAttribute
DDR_DQ3.Mode=DDR3
DDR_DQ3.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ3.Signal=DDR_DQ3
DDR_DQ4.GPIOParameters=PinAttribute
DDR_DQ4.Mode=DDR3
DDR_DQ4.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ4.Signal=DDR_DQ4
DDR_DQ5.GPIOParameters=PinAttribute
DDR_DQ5.Mode=DDR3
DDR_DQ5.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ5.Signal=DDR_DQ5
DDR_DQ6.GPIOParameters=PinAttribute
DDR_DQ6.Mode=DDR3
DDR_DQ6.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ6.Signal=DDR_DQ6
DDR_DQ7.GPIOParameters=PinAttribute
DDR_DQ7.Mode=DDR3
DDR_DQ7.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ7.Signal=DDR_DQ7
DDR_DQ8.GPIOParameters=PinAttribute
DDR_DQ8.Mode=DDR3
DDR_DQ8.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ8.Signal=DDR_DQ8
DDR_DQ9.GPIOParameters=PinAttribute
DDR_DQ9.Mode=DDR3
DDR_DQ9.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ9.Signal=DDR_DQ9
DDR_DQM0.GPIOParameters=PinAttribute
DDR_DQM0.Mode=DDR3
DDR_DQM0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQM0.Signal=DDR_DQM0
DDR_DQM1.GPIOParameters=PinAttribute
DDR_DQM1.Mode=DDR3
DDR_DQM1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQM1.Signal=DDR_DQM1
DDR_DQS0N.GPIOParameters=PinAttribute
DDR_DQS0N.Mode=DDR3
DDR_DQS0N.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS0N.Signal=DDR_DQS0N
DDR_DQS0P.GPIOParameters=PinAttribute
DDR_DQS0P.Mode=DDR3
DDR_DQS0P.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS0P.Signal=DDR_DQS0P
DDR_DQS1N.GPIOParameters=PinAttribute
DDR_DQS1N.Mode=DDR3
DDR_DQS1N.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS1N.Signal=DDR_DQS1N
DDR_DQS1P.GPIOParameters=PinAttribute
DDR_DQS1P.Mode=DDR3
DDR_DQS1P.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS1P.Signal=DDR_DQS1P
DDR_DTO0.GPIOParameters=PinAttribute
DDR_DTO0.Mode=DDR3
DDR_DTO0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DTO0.Signal=DDR_DTO0
DDR_DTO1.GPIOParameters=PinAttribute
DDR_DTO1.Mode=DDR3
DDR_DTO1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DTO1.Signal=DDR_DTO1
DDR_ODT.GPIOParameters=PinAttribute
DDR_ODT.Mode=DDR3
DDR_ODT.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_ODT.Signal=DDR_ODT
DDR_RASN.GPIOParameters=PinAttribute
DDR_RASN.Mode=DDR3
DDR_RASN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_RASN.Signal=DDR_RASN
DDR_RESETN.GPIOParameters=PinAttribute
DDR_RESETN.Mode=DDR3
DDR_RESETN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_RESETN.Signal=DDR_RESETN
DDR_VREF.GPIOParameters=PinAttribute
DDR_VREF.Mode=DDR3
DDR_VREF.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_VREF.Signal=DDR_VREF
DDR_WEN.GPIOParameters=PinAttribute
DDR_WEN.Mode=DDR3
DDR_WEN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_WEN.Signal=DDR_WEN
DDR_ZQ.GPIOParameters=PinAttribute
DDR_ZQ.Mode=DDR3
DDR_ZQ.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_ZQ.Signal=DDR_ZQ
DSIHOST_CKN.GPIOParameters=PinAttribute
DSIHOST_CKN.Mode=DSIHost_Video
DSIHOST_CKN.PinAttribute=CortexA7NS
DSIHOST_CKN.Signal=DSIHOST_CKN
DSIHOST_CKP.GPIOParameters=PinAttribute
DSIHOST_CKP.Mode=DSIHost_Video
DSIHOST_CKP.PinAttribute=CortexA7NS
DSIHOST_CKP.Signal=DSIHOST_CKP
DSIHOST_D0N.GPIOParameters=PinAttribute
DSIHOST_D0N.Mode=DSIHost_Video
DSIHOST_D0N.PinAttribute=CortexA7NS
DSIHOST_D0N.Signal=DSIHOST_D0N
DSIHOST_D0P.GPIOParameters=PinAttribute
DSIHOST_D0P.Mode=DSIHost_Video
DSIHOST_D0P.PinAttribute=CortexA7NS
DSIHOST_D0P.Signal=DSIHOST_D0P
DSIHOST_D1N.GPIOParameters=PinAttribute
DSIHOST_D1N.Mode=DSIHost_Video
DSIHOST_D1N.PinAttribute=CortexA7NS
DSIHOST_D1N.Signal=DSIHOST_D1N
DSIHOST_D1P.GPIOParameters=PinAttribute
DSIHOST_D1P.Mode=DSIHost_Video
DSIHOST_D1P.PinAttribute=CortexA7NS
DSIHOST_D1P.Signal=DSIHOST_D1P
FDCAN2.CalculateBaudRateNominal=300000
FDCAN2.CalculateTimeBitNominal=3333
FDCAN2.CalculateTimeQuantumNominal=666.6666666666666
FDCAN2.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal
File.Version=6
GIC.ADC1_IRQn=true\:false\:High level
GIC.DMA1_Stream0_IRQn=true\:false\:High level
GIC.DMA1_Stream1_IRQn=true\:false\:High level
GIC.DMA1_Stream2_IRQn=true\:false\:High level
GIC.DMA1_Stream3_IRQn=true\:false\:High level
GIC.DMA1_Stream4_IRQn=true\:false\:High level
GIC.DMA1_Stream5_IRQn=true\:false\:High level
GIC.DMA1_Stream6_IRQn=true\:false\:High level
GIC.DMA1_Stream7_IRQn=true\:false\:High level
GIC.ETH1_IRQn=true\:false\:High level
GIC.ETH1_WKUP_IRQn=true\:false\:High level
GIC.FDCAN2_IT0_IRQn=true\:false\:High level
GIC.FDCAN2_IT1_IRQn=true\:false\:High level
GIC.I2C1_ER_IRQn=true\:false\:High level
GIC.I2C1_EV_IRQn=true\:false\:High level
GIC.I2C4_ER_IRQn=true\:false\:High level
GIC.I2C4_EV_IRQn=true\:false\:High level
GIC.I2C6_ER_IRQn=true\:false\:High level
GIC.I2C6_EV_IRQn=true\:false\:High level
GIC.IPCC_RX0_IRQn=true\:false\:High level
GIC.IPCC_TX0_IRQn=true\:false\:High level
GIC.LTDC_ER_IRQn=true\:false\:High level
GIC.LTDC_IRQn=true\:false\:High level
GIC.MDMA_IRQn=true\:false\:High level
GIC.OTG_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RTC_WKUP_ALARM_IRQn=true\:false\:High level
GIC.SDMMC1_IRQn=true\:false\:High level
GIC.SDMMC3_IRQn=true\:false\:High level
GIC.SPI2_IRQn=true\:false\:High level
GIC.SPI3_IRQn=true\:false\:High level
GIC.SPI5_IRQn=true\:false\:High level
GIC.UART4_IRQn=true\:false\:High level
GIC.UART7_IRQn=true\:false\:High level
GIC.UART8_IRQn=true\:false\:High level
GIC.USBH_OHCI_IRQn=true\:false\:High level
GIC.WAKEUP_PIN_IRQn=true\:false\:High level
GPIO.groupedBy=Expand Peripherals
I2S2.ErrorAudioFreq=-0.35 %
I2S2.FullDuplexMode=I2S_MODE_MASTER_FD
I2S2.IPParameters=Instance,VirtualMode,FullDuplexMode,RealAudioFreq,ErrorAudioFreq
I2S2.Instance=SPI$Index
I2S2.RealAudioFreq=15.943 KHz
I2S2.VirtualMode=I2S_MODE_MASTER
I2S3.ErrorAudioFreq=-0.35 %
I2S3.FullDuplexMode=I2S_MODE_MASTER_FD
I2S3.IPParameters=Instance,VirtualMode,FullDuplexMode,RealAudioFreq,ErrorAudioFreq
I2S3.Instance=SPI$Index
I2S3.RealAudioFreq=15.943 KHz
I2S3.VirtualMode=I2S_MODE_MASTER
JTCK-SWCLK.GPIOParameters=PinAttribute
JTCK-SWCLK.Mode=JTAG_4_pins
JTCK-SWCLK.PinAttribute=CortexA7NS
JTCK-SWCLK.Signal=DEBUG_JTCK-SWCLK
JTDI.GPIOParameters=PinAttribute
JTDI.Mode=JTAG_4_pins
JTDI.PinAttribute=CortexA7NS
JTDI.Signal=DEBUG_JTDI
JTDO-TRACESWO.GPIOParameters=PinAttribute
JTDO-TRACESWO.Mode=JTAG_4_pins
JTDO-TRACESWO.PinAttribute=CortexA7NS
JTDO-TRACESWO.Signal=DEBUG_JTDO-SWO
JTMS-SWDIO.GPIOParameters=PinAttribute
JTMS-SWDIO.Mode=JTAG_4_pins
JTMS-SWDIO.PinAttribute=CortexA7NS
JTMS-SWDIO.Signal=DEBUG_JTMS-SWDIO
KeepUserPlacement=true
Mcu.CPN=STM32MP157FAB1
Mcu.Context0=BootROM
Mcu.Context1=BootLoader
Mcu.Context2=CortexA7S
Mcu.Context3=CortexA7NS
Mcu.Context4=CortexM4
Mcu.ContextNb=5
Mcu.Family=STM32MP1
Mcu.IP0=ADC1
Mcu.IP1=BSEC
Mcu.IP10=I2C1
Mcu.IP11=I2C4
Mcu.IP12=I2C6
Mcu.IP13=I2S2
Mcu.IP14=I2S3
Mcu.IP15=IPCC
Mcu.IP16=LTDC
Mcu.IP17=NVIC
Mcu.IP18=PWR
Mcu.IP19=RCC
Mcu.IP2=DDR
Mcu.IP20=RTC
Mcu.IP21=SDMMC1
Mcu.IP22=SDMMC3
Mcu.IP23=SPI5
Mcu.IP24=SYS
Mcu.IP25=TAMP
Mcu.IP26=TIM16
Mcu.IP27=UART4
Mcu.IP28=UART7
Mcu.IP29=UART8
Mcu.IP3=DEBUG
Mcu.IP30=USBH_HS1
Mcu.IP31=USB_OTG_HS
Mcu.IP4=DSIHOST
Mcu.IP5=ETH1
Mcu.IP6=ETZPC
Mcu.IP7=FDCAN2
Mcu.IP8=GIC
Mcu.IP9=HSEM
Mcu.IPNb=32
Mcu.Name=STM32MP157FABx
Mcu.Package=LFBGA354
Mcu.Pin0=PG15
Mcu.Pin1=PD0
Mcu.Pin10=DSIHOST_D1N
Mcu.Pin100=PA1
Mcu.Pin101=PF8
Mcu.Pin102=PD12
Mcu.Pin103=PD13
Mcu.Pin104=PA12
Mcu.Pin105=DDR_DQM1
Mcu.Pin106=DDR_DQS1P
Mcu.Pin107=PB11
Mcu.Pin108=PC1
Mcu.Pin109=PC5
Mcu.Pin11=DDR_DQ0
Mcu.Pin110=PB12
Mcu.Pin111=PG11
Mcu.Pin112=PD11
Mcu.Pin113=PF6
Mcu.Pin114=PE10
Mcu.Pin115=USB_DM2
Mcu.Pin116=USB_DP1
Mcu.Pin117=PA11
Mcu.Pin118=DDR_DQ14
Mcu.Pin119=DDR_DQ11
Mcu.Pin12=DDR_DQ1
Mcu.Pin120=PA2
Mcu.Pin121=PC4
Mcu.Pin122=PB8
Mcu.Pin123=PF7
Mcu.Pin124=PF9
Mcu.Pin125=PG7
Mcu.Pin126=USB_DP2
Mcu.Pin127=USB_DM1
Mcu.Pin128=DDR_VREF
Mcu.Pin129=DDR_DQ15
Mcu.Pin13=PE1
Mcu.Pin130=DDR_DQ12
Mcu.Pin131=VP_BSEC_VS_BSEC
Mcu.Pin132=VP_DDR_DDR3
Mcu.Pin133=VP_DDR_DDR_16_bits
Mcu.Pin134=VP_DDR_DDR3_16_4Gb
Mcu.Pin135=VP_ETZPC_VS_ETZPC
Mcu.Pin136=VP_HSEM_VS_HSEM
Mcu.Pin137=VP_IPCC_VS_IPCC
Mcu.Pin138=VP_LTDC_DSIMode
Mcu.Pin139=VP_PWR_V_PVD_IN
Mcu.Pin14=PD7
Mcu.Pin140=VP_RTC_VS_RTC_Activate
Mcu.Pin141=VP_SYS_VS_Systick
Mcu.Pin142=VP_TAMP_VS_TAMP_Activate
Mcu.Pin143=VP_DMA_VS_DMA1_A7NS
Mcu.Pin144=VP_DMA_VS_DMA2_M4
Mcu.Pin145=VP_MDMA_VS_MDMA_A7NS_8
Mcu.Pin15=PB7
Mcu.Pin16=PA8
Mcu.Pin17=PB4
Mcu.Pin18=PD2
Mcu.Pin19=DSIHOST_D0P
Mcu.Pin2=PD1
Mcu.Pin20=DSIHOST_CKP
Mcu.Pin21=DSIHOST_D1P
Mcu.Pin22=DDR_DQ3
Mcu.Pin23=DDR_DQ7
Mcu.Pin24=DDR_DQS0N
Mcu.Pin25=PE0
Mcu.Pin26=PA15
Mcu.Pin27=PA9
Mcu.Pin28=PB14
Mcu.Pin29=PC12
Mcu.Pin3=PE3
Mcu.Pin30=PC8
Mcu.Pin31=DDR_DQM0
Mcu.Pin32=DDR_DQS0P
Mcu.Pin33=PE14
Mcu.Pin34=PD4
Mcu.Pin35=PD5
Mcu.Pin36=PB9
Mcu.Pin37=PC10
Mcu.Pin38=JTDI
Mcu.Pin39=JTDO-TRACESWO
Mcu.Pin4=PB3
Mcu.Pin40=JTMS-SWDIO
Mcu.Pin41=JTCK-SWCLK
Mcu.Pin42=DDR_DQ5
Mcu.Pin43=DDR_DQ2
Mcu.Pin44=DDR_DQ6
Mcu.Pin45=PE15
Mcu.Pin46=DDR_A7
Mcu.Pin47=DDR_DQ4
Mcu.Pin48=DDR_A13
Mcu.Pin49=DDR_ZQ
Mcu.Pin5=PB15
Mcu.Pin50=DDR_A3
Mcu.Pin51=DDR_RESETN
Mcu.Pin52=DDR_A9
Mcu.Pin53=DDR_A2
Mcu.Pin54=DDR_BA0
Mcu.Pin55=PC14-OSC32_IN
Mcu.Pin56=PC15-OSC32_OUT
Mcu.Pin57=DDR_A5
Mcu.Pin58=DDR_A0
Mcu.Pin59=DDR_ODT
Mcu.Pin6=PC9
Mcu.Pin60=DDR_BA2
Mcu.Pin61=DDR_WEN
Mcu.Pin62=DDR_CSN
Mcu.Pin63=DDR_DTO1
Mcu.Pin64=PC13
Mcu.Pin65=DDR_CASN
Mcu.Pin66=DDR_DTO0
Mcu.Pin67=DDR_CLKN
Mcu.Pin68=DDR_A12
Mcu.Pin69=DDR_RASN
Mcu.Pin7=PC11
Mcu.Pin70=DDR_CLKP
Mcu.Pin71=PH0-OSC_IN
Mcu.Pin72=PH1-OSC_OUT
Mcu.Pin73=DDR_A1
Mcu.Pin74=DDR_A11
Mcu.Pin75=DDR_A10
Mcu.Pin76=DDR_A6
Mcu.Pin77=DDR_BA1
Mcu.Pin78=DDR_A14
Mcu.Pin79=DDR_ATO
Mcu.Pin8=DSIHOST_D0N
Mcu.Pin80=PA13
Mcu.Pin81=PA5
Mcu.Pin82=DDR_A4
Mcu.Pin83=DDR_DQ8
Mcu.Pin84=DDR_CKE
Mcu.Pin85=PA14
Mcu.Pin86=PA0
Mcu.Pin87=PA4
Mcu.Pin88=DDR_A8
Mcu.Pin89=DDR_DQ10
Mcu.Pin9=DSIHOST_CKN
Mcu.Pin90=PA7
Mcu.Pin91=PB13
Mcu.Pin92=PE7
Mcu.Pin93=PE8
Mcu.Pin94=PB6
Mcu.Pin95=PB2
Mcu.Pin96=DDR_DQ9
Mcu.Pin97=DDR_DQ13
Mcu.Pin98=DDR_DQS1N
Mcu.Pin99=PG13
Mcu.PinsNb=146
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP157FABx
MxCube.Version=6.15.0
MxDb.Version=DB.6.0.150
NVIC.BusFault_IRQn=true\:1\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:1\:0\:false\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.MemoryManagement_IRQn=true\:1\:0\:false\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:1\:0\:false\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.SVCall_IRQn=true\:1\:0\:false\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:1\:0\:false\:false\:true\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=WakeUp1
PA0.PinAttribute=CortexA7S,CortexA7NS,CortexM4
PA0.Signal=PWR_WKUP1
PA1.GPIOParameters=PinAttribute
PA1.Mode=ETH Ref Clock Input
PA1.PinAttribute=CortexA7NS
PA1.Signal=ETH1_REF_CLK
PA11.GPIOParameters=PinAttribute
PA11.Mode=I2C
PA11.PinAttribute=CortexA7NS
PA11.Signal=I2C6_SCL
PA12.GPIOParameters=PinAttribute
PA12.Mode=I2C
PA12.PinAttribute=CortexA7NS
PA12.Signal=I2C6_SDA
PA13.GPIOParameters=GPIO_Label,PinAttribute
PA13.GPIO_Label=LED_B/STATE
PA13.Locked=true
PA13.PinAttribute=Free
PA13.Signal=GPIO_Output
